; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-4-8)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	)
(:init
	(at plane1 city0)
	(= (capacity plane1) 4408)
	(= (fuel plane1) 560)
	(= (slow-burn plane1) 2)
	(= (fast-burn plane1) 7)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 4)
	(at plane2 city4)
	(= (capacity plane2) 9671)
	(= (fuel plane2) 1928)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 14)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 9)
	(at plane3 city0)
	(= (capacity plane3) 2200)
	(= (fuel plane3) 769)
	(= (slow-burn plane3) 1)
	(= (fast-burn plane3) 3)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 1)
	(at plane4 city3)
	(= (capacity plane4) 4791)
	(= (fuel plane4) 745)
	(= (slow-burn plane4) 2)
	(= (fast-burn plane4) 6)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 7)
	(at person1 city4)
	(at person2 city1)
	(at person3 city1)
	(at person4 city2)
	(at person5 city3)
	(at person6 city2)
	(at person7 city3)
	(at person8 city3)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 752)
	(= (distance city0 city2) 577)
	(= (distance city0 city3) 666)
	(= (distance city0 city4) 849)
	(= (distance city1 city0) 752)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 545)
	(= (distance city1 city3) 805)
	(= (distance city1 city4) 526)
	(= (distance city2 city0) 577)
	(= (distance city2 city1) 545)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 833)
	(= (distance city2 city4) 942)
	(= (distance city3 city0) 666)
	(= (distance city3 city1) 805)
	(= (distance city3 city2) 833)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 621)
	(= (distance city4 city0) 849)
	(= (distance city4 city1) 526)
	(= (distance city4 city2) 942)
	(= (distance city4 city3) 621)
	(= (distance city4 city4) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city1)
	(at plane4 city0)
	(at person1 city2)
	(at person2 city4)
	(at person3 city3)
	(at person4 city4)
	(at person5 city3)
	(at person6 city1)
	(at person7 city1)
	(at person8 city3)
	))

(:metric minimize (+ (* 5 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (refuel plane1 city0)
   changed: (fuel plane1) from 560 to 4408
   goals met: 2 of 10
2. (fly plane3 city0 city3)
   deleted: (at plane3 city0)
   added: (at plane3 city3)
   changed: (total-fuel-used) from 0 to 666, (fuel plane3) from 769 to 103
   goals met: 2 of 10
3. (fly plane1 city0 city4)
   deleted: (at plane1 city0)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 666 to 2364, (fuel plane1) from 4408 to 2710
   goals met: 2 of 10
4. (refuel plane4 city3)
   changed: (fuel plane4) from 745 to 4791
   goals met: 2 of 10
5. (board person1 plane1 city4)
   deleted: (at person1 city4)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 10
6. (fly plane1 city4 city1)
   deleted: (at plane1 city4)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 2364 to 3416, (fuel plane1) from 2710 to 1658
   goals met: 3 of 10
7. (board person2 plane1 city1)
   deleted: (at person2 city1)
   added: (in person2 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 3 of 10
8. (board person3 plane1 city1)
   deleted: (at person3 city1)
   added: (in person3 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 3 of 10
9. (board person7 plane4 city3)
   deleted: (at person7 city3)
   added: (in person7 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 3 of 10
10. (zoom plane4 city3 city0)
   deleted: (at plane4 city3)
   added: (at plane4 city0)
   changed: (total-fuel-used) from 3416 to 7412, (fuel plane4) from 4791 to 795
   goals met: 4 of 10
11. (refuel plane4 city0)
   changed: (fuel plane4) from 795 to 4791
   goals met: 4 of 10
12. (zoom plane4 city0 city1)
   deleted: (at plane4 city0)
   added: (at plane4 city1)
   changed: (total-fuel-used) from 7412 to 11924, (fuel plane4) from 4791 to 279
   goals met: 3 of 10
13. (debark person7 plane4 city1)
   deleted: (in person7 plane4)
   added: (at person7 city1)
   changed: (onboard plane4) from 1 to 0
   goals met: 4 of 10
14. (refuel plane4 city1)
   changed: (fuel plane4) from 279 to 4791
   goals met: 4 of 10
15. (zoom plane4 city1 city0)
   deleted: (at plane4 city1)
   added: (at plane4 city0)
   changed: (total-fuel-used) from 11924 to 16436, (fuel plane4) from 4791 to 279
   goals met: 5 of 10
16. (fly plane1 city1 city2)
   deleted: (at plane1 city1)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 16436 to 17526, (fuel plane1) from 1658 to 568
   goals met: 4 of 10
17. (debark person1 plane1 city2)
   deleted: (in person1 plane1)
   added: (at person1 city2)
   changed: (onboard plane1) from 3 to 2
   goals met: 5 of 10
18. (refuel plane1 city2)
   changed: (fuel plane1) from 568 to 4408
   goals met: 5 of 10
19. (board person4 plane1 city2)
   deleted: (at person4 city2)
   added: (in person4 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 5 of 10
20. (board person6 plane1 city2)
   deleted: (at person6 city2)
   added: (in person6 plane1)
   changed: (onboard plane1) from 3 to 4
   goals met: 5 of 10
21. (fly plane1 city2 city1)
   deleted: (at plane1 city2)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 17526 to 18616, (fuel plane1) from 4408 to 3318
   goals met: 6 of 10
22. (debark person6 plane1 city1)
   deleted: (in person6 plane1)
   added: (at person6 city1)
   changed: (onboard plane1) from 4 to 3
   goals met: 7 of 10
23. (fly plane1 city1 city4)
   deleted: (at plane1 city1)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 18616 to 19668, (fuel plane1) from 3318 to 2266
   goals met: 6 of 10
24. (debark person2 plane1 city4)
   deleted: (in person2 plane1)
   added: (at person2 city4)
   changed: (onboard plane1) from 3 to 2
   goals met: 7 of 10
25. (debark person4 plane1 city4)
   deleted: (in person4 plane1)
   added: (at person4 city4)
   changed: (onboard plane1) from 2 to 1
   goals met: 8 of 10
26. (fly plane1 city4 city1)
   deleted: (at plane1 city4)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 19668 to 20720, (fuel plane1) from 2266 to 1214
   goals met: 9 of 10
27. (refuel plane1 city1)
   changed: (fuel plane1) from 1214 to 4408
   goals met: 9 of 10
28. (fly plane1 city1 city3)
   deleted: (at plane1 city1)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 20720 to 22330, (fuel plane1) from 4408 to 2798
   goals met: 8 of 10
29. (debark person3 plane1 city3)
   deleted: (in person3 plane1)
   added: (at person3 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 9 of 10
30. (fly plane1 city3 city1)
   deleted: (at plane1 city3)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 22330 to 23940, (fuel plane1) from 2798 to 1188
   goals met: 10 of 10
